evidence/OPS-2203/before/k6-console.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2203.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * admissions_surge: 500 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 1 complete and 0 interrupted iterations
admissions_surge   [   3% ] 500 VUs  01.0s/30s

running (0m02.0s), 500/500 VUs, 3 complete and 0 interrupted iterations
admissions_surge   [   7% ] 500 VUs  02.0s/30s

running (0m03.0s), 500/500 VUs, 5 complete and 0 interrupted iterations
admissions_surge   [  10% ] 500 VUs  03.0s/30s

running (0m04.0s), 500/500 VUs, 7 complete and 0 interrupted iterations
admissions_surge   [  13% ] 500 VUs  04.0s/30s

running (0m05.0s), 500/500 VUs, 9 complete and 0 interrupted iterations
admissions_surge   [  17% ] 500 VUs  05.0s/30s

running (0m06.0s), 500/500 VUs, 11 complete and 0 interrupted iterations
admissions_surge   [  20% ] 500 VUs  06.0s/30s

running (0m07.0s), 500/500 VUs, 13 complete and 0 interrupted iterations
admissions_surge   [  23% ] 500 VUs  07.0s/30s

running (0m08.0s), 500/500 VUs, 15 complete and 0 interrupted iterations
admissions_surge   [  27% ] 500 VUs  08.0s/30s

running (0m09.0s), 500/500 VUs, 17 complete and 0 interrupted iterations
admissions_surge   [  30% ] 500 VUs  09.0s/30s

running (0m10.0s), 500/500 VUs, 19 complete and 0 interrupted iterations
admissions_surge   [  33% ] 500 VUs  10.0s/30s

running (0m11.0s), 500/500 VUs, 21 complete and 0 interrupted iterations
admissions_surge   [  37% ] 500 VUs  11.0s/30s

running (0m12.0s), 500/500 VUs, 23 complete and 0 interrupted iterations
admissions_surge   [  40% ] 500 VUs  12.0s/30s

running (0m13.0s), 500/500 VUs, 25 complete and 0 interrupted iterations
admissions_surge   [  43% ] 500 VUs  13.0s/30s

running (0m14.0s), 500/500 VUs, 27 complete and 0 interrupted iterations
admissions_surge   [  47% ] 500 VUs  14.0s/30s

running (0m15.0s), 500/500 VUs, 29 complete and 0 interrupted iterations
admissions_surge   [  50% ] 500 VUs  15.0s/30s

running (0m16.0s), 500/500 VUs, 31 complete and 0 interrupted iterations
admissions_surge   [  53% ] 500 VUs  16.0s/30s

running (0m17.0s), 500/500 VUs, 33 complete and 0 interrupted iterations
admissions_surge   [  57% ] 500 VUs  17.0s/30s

running (0m18.0s), 500/500 VUs, 35 complete and 0 interrupted iterations
admissions_surge   [  60% ] 500 VUs  18.0s/30s

running (0m19.0s), 500/500 VUs, 37 complete and 0 interrupted iterations
admissions_surge   [  63% ] 500 VUs  19.0s/30s

running (0m20.0s), 500/500 VUs, 39 complete and 0 interrupted iterations
admissions_surge   [  67% ] 500 VUs  20.0s/30s

running (0m21.0s), 500/500 VUs, 41 complete and 0 interrupted iterations
admissions_surge   [  70% ] 500 VUs  21.0s/30s

running (0m22.0s), 500/500 VUs, 43 complete and 0 interrupted iterations
admissions_surge   [  73% ] 500 VUs  22.0s/30s

running (0m23.0s), 500/500 VUs, 45 complete and 0 interrupted iterations
admissions_surge   [  77% ] 500 VUs  23.0s/30s

running (0m24.0s), 500/500 VUs, 47 complete and 0 interrupted iterations
admissions_surge   [  80% ] 500 VUs  24.0s/30s

running (0m25.0s), 500/500 VUs, 49 complete and 0 interrupted iterations
admissions_surge   [  83% ] 500 VUs  25.0s/30s

running (0m26.0s), 500/500 VUs, 51 complete and 0 interrupted iterations
admissions_surge   [  87% ] 500 VUs  26.0s/30s

running (0m27.0s), 500/500 VUs, 53 complete and 0 interrupted iterations
admissions_surge   [  90% ] 500 VUs  27.0s/30s

running (0m28.0s), 500/500 VUs, 55 complete and 0 interrupted iterations
admissions_surge   [  93% ] 500 VUs  28.0s/30s

running (0m29.0s), 500/500 VUs, 56 complete and 0 interrupted iterations
admissions_surge   [  97% ] 500 VUs  29.0s/30s

running (0m30.0s), 500/500 VUs, 58 complete and 0 interrupted iterations
admissions_surge   [ 100% ] 500 VUs  30.0s/30s

running (0m31.0s), 499/500 VUs, 60 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m32.0s), 497/500 VUs, 62 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m33.0s), 495/500 VUs, 64 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m34.0s), 493/500 VUs, 66 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m35.0s), 491/500 VUs, 68 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m36.0s), 489/500 VUs, 70 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m37.0s), 487/500 VUs, 72 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m38.0s), 485/500 VUs, 74 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m39.0s), 483/500 VUs, 76 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m40.0s), 481/500 VUs, 78 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m41.0s), 479/500 VUs, 80 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m42.0s), 477/500 VUs, 82 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m43.0s), 475/500 VUs, 84 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m44.0s), 473/500 VUs, 86 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m45.0s), 471/500 VUs, 88 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m46.0s), 469/500 VUs, 90 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m47.0s), 467/500 VUs, 92 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m48.0s), 465/500 VUs, 94 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m49.0s), 463/500 VUs, 96 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m50.0s), 461/500 VUs, 98 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m51.0s), 459/500 VUs, 100 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m52.0s), 457/500 VUs, 102 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m53.0s), 455/500 VUs, 104 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m54.0s), 453/500 VUs, 106 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m55.0s), 451/500 VUs, 108 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m56.0s), 449/500 VUs, 110 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m57.0s), 447/500 VUs, 112 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m58.0s), 446/500 VUs, 113 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m59.0s), 444/500 VUs, 115 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (1m00.0s), 442/500 VUs, 117 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<1000' p(95)=57.02s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 118     1.965806/s
    checks_succeeded...: 100.00% 118 out of 118
    checks_failed......: 0.00%   0 out of 118

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=30.23s min=558.06ms med=30.23s max=59.98s p(90)=54.07s p(95)=57.02s
      { expected_response:true }...: avg=30.23s min=558.06ms med=30.23s max=59.98s p(90)=54.07s p(95)=57.02s
    http_req_failed................: 0.00% 0 out of 118
    http_reqs......................: 118   1.965806/s

    EXECUTION
    iteration_duration.............: avg=30.24s min=563.3ms  med=30.24s max=59.98s p(90)=54.08s p(95)=57.03s
    iterations.....................: 118   1.965806/s
    vus............................: 442   min=442      max=500
    vus_max........................: 500   min=500      max=500

    NETWORK
    data_received..................: 32 kB 533 B/s
    data_sent......................: 81 kB 1.4 kB/s



running (1m00.0s), 000/500 VUs, 118 complete and 441 interrupted iterations
admissions_surge ✓ [ 100% ] 500 VUs  30s
time="2026-08-11T18:21:00+03:00" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"